{
    "title": "Flexible Processing Control",
    "description": "An automated production line consists of 5 workstations: numbered 1# to 5# from left to right. The 1# station is used for raw material loading, stations 2# to 4# are used for product processing, and the 5# station is used for finished product output and storage.\nThere is a motor in the production line, responsible for moving the product from one workstation to the next. Each workstation has a sensor (used to detect if the product has arrived).\nEach product has a different sequence and number of processing steps, specified by the process sequence 'processSequence'. The processSequence is an array type, storing the sequence numbers of the workstations, and the system automatically sends the raw materials to the corresponding workstation for processing based on the station number.\nControl requirements:\nAt the start of production, when the sensor at the 1# station (sensor1) detects the raw material, the start button at the 1# station (station1Start) is pressed. The system queries the first element of the process sequence 'processSequence', starts the conveyor to move the raw material to the corresponding workstation, and stops after delivery. Upon receiving the processing completion signal from the corresponding workstation (station2Complete to station4Complete), it continues to query the next element of the process sequence 'processSequence', determines the direction of the conveyor, and starts the conveyor (conveyorLeft, conveyorRight). This continues until the product is delivered to the 5# workstation.",
    "type": "FUNCTION_BLOCK",
    "name": "FlexibleProduction",
    "input": [
        {
            "name": "sensor1",
            "type": "Bool",
            "description": "Sensor at 1# station"
        },
        {
            "name": "sensor2",
            "type": "Bool",
            "description": "Sensor at 2# station"
        },
        {
            "name": "sensor3",
            "type": "Bool",
            "description": "Sensor at 3# station"
        },
        {
            "name": "sensor4",
            "type": "Bool",
            "description": "Sensor at 4# station"
        },
        {
            "name": "sensor5",
            "type": "Bool",
            "description": "Sensor at 5# station"
        },
        {
            "name": "station1Start",
            "type": "Bool",
            "description": "Start button at 1# station"
        },
        {
            "name": "station2Complete",
            "type": "Bool",
            "description": "Processing completion signal at 2# station"
        },
        {
            "name": "station3Complete",
            "type": "Bool",
            "description": "Processing completion signal at 3# station"
        },
        {
            "name": "station4Complete",
            "type": "Bool",
            "description": "Processing completion signal at 4# station"
        }
    ],
    "output": [
        {
            "name": "conveyorLeft",
            "type": "Bool",
            "description": "Conveyor turns left"
        },
        {
            "name": "conveyorRight",
            "type": "Bool",
            "description": "Conveyor turns right"
        }
    ],
    "in/out": [
        {
            "name": "processSequence",
            "type": "Array[1..8] of USInt",
            "description": "Processing sequence"
        }
    ]
 }