{
    "title": "Buffer Search Function",
    "description": "BUFFER_SEARCH (ADR (Array), SIZEOF (ARRAY),\nSTR, POS, IGN), where ARRAY is the name of the array. ADR() is a standard\nfunction which identifes the pointer to the array and SIZEOF() is a stan￾dard function, which determines the size of the array. The function returns\nthe string copied from the bufer as STRING. This type of processing arrays\nis very efcient because no additional memory is required and no surren￾der values must be copied. If IGN = TRUE both upper- and lowercase let￾ters are found as a match, while STR must be present in uppercase letters.\nIf IGN = FALSE case sensitive is searched.",
    "type": "FUNCTION",
    "name": "BUFFER_SEARCH",
    "input": [
        {
            "name": "PT",
            "type": "POINTER TO ARRAY[0..32767] OF BYTE",
            "description": "A pointer to the array of bytes that represents the buffer to be searched."
        },
        {
            "name": "SIZE",
            "type": "INT",
            "description": "The size of the buffer, indicating how many bytes can be considered for the search."
        },
        {
            "name": "STR",
            "type": "STRING",
            "description": "The string to search for in the buffer."
        },
        {
            "name": "POS",
            "type": "INT",
            "description": "The starting position in the buffer from which to begin the search."
        },
        {
            "name": "IGN",
            "type": "BOOL",
            "description": "A boolean flag indicating whether the search should be case-insensitive (true) or case-sensitive (false)."
        }
    ],
    "output": [
        {
            "name": "BUFFER_SEARCH",
            "type": "INT",
            "description": "The position at which the substring is found within the buffer, or -1 if the substring is not found."
        }
    ],
    "in/out": [],
    "return_value": {
        "type": "INT",
        "description": "The function returns the index of the first occurrence of the substring in the buffer or -1 if not found."
    }
}