{
    "title": "PID Controller Function Block",
    "description": "CTRL_PI is a PI controller with dynamic anti-wind-up and manual control in￾put. The PI controller operates according to the formula:\nY = KP * DIFF + KI * INTEG(DIFF) + OFFSET\nwhere DIFF = SET_POINT - ACTUAL\nIn manual mode (manual = TRUE) is: Y = MANUAL_IN+ OFFSET\nACT is the measured value for the controlled system and set the setpoint\nfor the controller. The input values of LH and LL limit Output value Y. With\nRST the internal integrator may be set to 0 any time. The output LIM si￾gnals that the controller has reached the limit of LL or LH. The PI controller\nis free running and uses the trapezoidal rule to calculate the integrator for\nthe highest accuracy and optimal speed. The Default Values of the input\nparameters are predefned as follows: KP = 1, KI = 1, LIMIT_L = -1000 and\nLIMIT_H = +1000. With the input SUP a noise reduction is set, the value on\ninput SUP determines at which control diference the controller turns on.\nWith SUP is avoided that the output of the controller varies continously.\nThe value at the input SUP should be in dimension that it suppresses the\nnoise of the controlled system and the sensors. If the input to SUP is set to\n0.1, the controller is only at deviations greater than 0.1 active. At the out￾put DIFF the measured and through a Noise Filter (DEAD_BAND) fltered\ncontrol deviation is available. DIFF is normally not required in a controlled\nsystem but can be used to infuence the control parameters. The input\nOFS is added as the last value to output, and is used to compensate main￾ly of noise, whose efect can be estimated on the loop. \nThe controller works with a dynamic air- Up that prevents that the integra￾tor, when reaching a output limit and further deviation, continues to run\nunlimited and afects the properties usually negative. In the introduction\nchapter of the control technology, more details can be found on anti-wind￾up. \nThe following graph illustrates the internal structure of the controller:",
    "type": "FUNCTION_BLOCK",
    "name": "CTRL_PI",
    "input": [
        {
            "name": "ACT",
            "type": "REAL",
            "description": "The actual value to be used in the PID control."
        },
        {
            "name": "SET",
            "type": "REAL",
            "description": "The desired setpoint value for the PID control."
        },
        {
            "name": "SUP",
            "type": "REAL",
            "description": "The reference value for supervision purposes."
        },
        {
            "name": "OFS",
            "type": "REAL",
            "description": "Offset value to adjust the output signal."
        },
        {
            "name": "M_I",
            "type": "REAL",
            "description": "Manual input value for the controller."
        },
        {
            "name": "MAN",
            "type": "BOOL",
            "description": "Manual mode switch; if true, the controller uses manual input."
        },
        {
            "name": "RST",
            "type": "BOOL",
            "description": "Reset signal to reset the controller operation."
        },
        {
            "name": "KP",
            "type": "REAL",
            "description": "Proportional gain factor for the PID controller.",
            "fields": null
        },
        {
            "name": "KI",
            "type": "REAL",
            "description": "Integral gain factor for the PID controller.",
            "fields": null
        },
        {
            "name": "LL",
            "type": "REAL",
            "description": "Lower limit for the output value.",
            "fields": null
        },
        {
            "name": "LH",
            "type": "REAL",
            "description": "Upper limit for the output value.",
            "fields": null
        }
    ],
    "output": [
        {
            "name": "Y",
            "type": "REAL",
            "description": "The output value generated by the PID controller."
        },
        {
            "name": "DIFF",
            "type": "REAL",
            "description": "The difference between the setpoint and actual value."
        },
        {
            "name": "LIM",
            "type": "BOOL",
            "description": "Flag indicating whether the output is within the limits."
        }
    ],
    "in/out": [],
    "return_value": null
}