{
    "title": "Bit Generator Function Block",
    "description": "GEN_BIT is a fully programmable pattern generator. At the inputs in0 .. IN7\nare the bit patterns at the input CLK in each case as a DWORD and passed\nby each clock pulse to the outputs Q0 .. Q3 starting from bit 0 of ascen￾ding. After the frst clock pulse at the input CLK the output Q0 has bit 0 of\nIN0 , at Q1 is bit 0 of In1 ... on Q7 is bit 0 of IN3. After the next clock pulse\nat the CLK input, the bit 1 of the inputs IN is passed to the outputs Q and\nso on, until the sequence is completed. The input STEPS determines how\nmany bits of the input DWORDS be passed to the outputs. The input REP\ndetermines how often this sequence is repeated. If the input set to 0, the\nsequence is repeated continuously. An asynchronous reset can always re￾set the sequencer. The outputs CNT and RUN indicate which bit is current￾ly passed to the output and whether the sequencer is running, or the se￾quence (RUN inactive) has fnished. After the sequences have expired the\nlast bit patterns remains on the outputs available until a reset restarts the\ngenerator.",
    "type": "FUNCTION_BLOCK",
    "name": "GEN_BIT",
    "input": [
        {
            "name": "in0",
            "type": "DWORD",
            "description": "First input DWORD value for bit shifting."
        },
        {
            "name": "in1",
            "type": "DWORD",
            "description": "Second input DWORD value for bit shifting."
        },
        {
            "name": "in2",
            "type": "DWORD",
            "description": "Third input DWORD value for bit shifting."
        },
        {
            "name": "in3",
            "type": "DWORD",
            "description": "Fourth input DWORD value for bit shifting."
        },
        {
            "name": "clk",
            "type": "BOOL",
            "description": "Clock signal to trigger the operation."
        },
        {
            "name": "steps",
            "type": "INT",
            "description": "Number of steps to process before resetting."
        },
        {
            "name": "rep",
            "type": "INT",
            "description": "Number of times to repeat the operation; 0 for continuous operation."
        },
        {
            "name": "rst",
            "type": "BOOL",
            "description": "Reset signal to initialize the block."
        }
    ],
    "output": [
        {
            "name": "Q0",
            "type": "BOOL",
            "description": "Output for the least significant bit of in0."
        },
        {
            "name": "Q1",
            "type": "BOOL",
            "description": "Output for the least significant bit of in1."
        },
        {
            "name": "Q2",
            "type": "BOOL",
            "description": "Output for the least significant bit of in2."
        },
        {
            "name": "Q3",
            "type": "BOOL",
            "description": "Output for the least significant bit of in3."
        },
        {
            "name": "cnt",
            "type": "INT",
            "description": "Current step count in the operation."
        },
        {
            "name": "run",
            "type": "BOOL",
            "description": "Indicates if the block is currently running."
        }
    ],
    "in/out": [],
    "return_value": null
}